Tekla.Structures.ModelInternal.dotnetDoubleList_t


Tekla.Structures.ModelInternal.dotnetDoubleList_t.IndexCurrentItem
The index of the current item.

Tekla.Structures.ModelInternal.dotnetDoubleList_t.NumberItems
The number of items.

Tekla.Structures.ModelInternal.dotnetDoubleList_t.NumberItemsInSet
The number of items in the set.

Tekla.Structures.ModelInternal.dotnetDoubleList_t.aDoubleList
The actual values stored in an array.

Tekla.Structures.ModelInternal.dotnetDoubleList_t.ClientId


Tekla.Structures.ModelInternal.dotnetDoubleList_t.#ctor(System.Int32)
Initializes a new instance of the Tekla.Structures.ModelInternal.dotnetDoubleList_t struct.
size: The size.

Tekla.Structures.ModelInternal.dotnetDoubleList_t.ToStruct(Tekla.Structures.ModelInternal.DoubleList)
Fills the struct from the given double list.
doubleList: The double list.

Tekla.Structures.ModelInternal.dotnetDoubleList_t.FromStruct(Tekla.Structures.ModelInternal.DoubleList)
Fills the double list from this struct.
doubleList: The double list.